000
10
100
11
12
13
15
1950s
1970s
20
30
40
50
50s
60s
70s
80s
90
90s
ability
able
absolute
absolutely
absurd
academy
accent
accept
accident
according
accurate
act
acted
acting
action
actions
actor
actors
actress
actresses
acts
actual
actually
adam
adaptation
add
added
addition
adds
admit
adult
adults
adventure
advice
affair
afraid
african
age
aged
agent
ages
ago
agree
ahead
air
al
alan
alex
alice
alien
aliens
alive
allen
allow
allowed
allows
amazing
america
american
americans
amusing
ancient
andy
angry
animal
animals
animated
animation
ann
anne
annoying
answer
anthony
anti
anybody
anymore
apart
apartment
apparent
apparently
appeal
appear
appearance
appeared
appears
appreciate
approach
area
arent
army
art
arthur
artist
artistic
arts
asian
aside
ask
asked
asking
asks
aspect
aspects
ass
assume
atmosphere
attack
attempt
attempts
attention
attitude
attractive
audience
audiences
australian
author
available
average
avoid
award
awards
aware
away
awesome
awful
awkward
baby
background
bad
badly
ball
band
bank
bar
barbara
barely
based
basic
basically
batman
battle
beach
bear
beat
beautiful
beautifully
beauty
bed
began
begin
beginning
begins
behavior
believable
believe
believes
ben
best
better
big
bigger
biggest
billy
bit
bits
bizarre
black
blame
bland
blind
blonde
blood
bloody
blue
board
boat
bob
bodies
body
bomb
bond
book
books
bored
boring
born
boss
bother
bought
box
boy
boyfriend
boys
brain
break
breaking
breaks
brian
brief
bright
brilliant
brilliantly
bring
bringing
brings
british
broken
brother
brothers
brought
brown
bruce
brutal
buddy
budget
build
building
built
bunch
business
buy
cable
called
calls
came
cameo
camera
camp
candy
capable
captain
capture
captured
car
care
career
cares
carry
cars
cartoon
case
cash
cast
casting
castle
cat
catch
caught
cause
caused
center
central
century
certain
certainly
cgi
chance
change
changed
changes
channel
character
characters
charles
charlie
charm
charming
chase
cheap
check
cheesy
chemistry
chick
child
childhood
children
chinese
choice
choose
chosen
chris
christian
christmas
christopher
church
cinema
cinematic
cinematography
circumstances
city
class
classic
classics
clean
clear
clearly
clever
cliché
clichés
climax
close
clothes
club
cold
collection
college
color
combination
come
comedic
comedies
comedy
comes
comic
coming
comment
commentary
comments
commercial
common
community
company
compare
compared
comparison
compelling
complete
completely
complex
computer
concept
concerned
conclusion
conflict
confused
confusing
connection
consider
considered
considering
constant
constantly
contains
content
context
continue
continues
contrast
contrived
control
convincing
cool
cop
cops
copy
core
corny
correct
cost
costs
costumes
count
country
couple
course
cover
crap
crappy
crash
crazy
create
created
creates
creating
creative
creature
creatures
credit
credits
creepy
crew
crime
criminal
critics
cross
crowd
cult
culture
curious
current
cut
cute
cuts
dad
damn
dan
dance
dancing
dangerous
danny
dark
date
dated
daughter
david
davis
day
days
dead
deal
dealing
deals
death
debut
decade
decent
decide
decided
decides
decision
deep
deeply
definitely
delightful
deliver
delivered
delivers
depth
described
desert
deserve
deserved
deserves
design
desire
desperate
despite
destroy
details
detective
develop
developed
development
devil
dialog
dialogue
dick
did
didnt
die
died
dies
difference
different
difficult
dimensional
direct
directed
directing
direction
director
directors
dirty
disappointed
disappointing
disappointment
disaster
discover
discovered
discovers
disgusting
disney
disturbing
doctor
documentary
does
doesnt
dog
dogs
doing
dollars
don
dont
door
double
doubt
douglas
dr
drag
drama
dramatic
drawn
dreadful
dream
dreams
dressed
drive
driven
driving
drug
drugs
drunk
dubbed
dull
dumb
dvd
dying
earlier
early
earth
easily
easy
eat
eating
ed
eddie
edge
edited
editing
effect
effective
effects
effort
efforts
element
elements
embarrassing
emotion
emotional
emotionally
emotions
end
ended
ending
endless
ends
enemy
energy
engaging
england
english
enjoy
enjoyable
enjoyed
entertaining
entertainment
entire
entirely
epic
episode
episodes
equally
era
eric
escape
especially
essentially
europe
european
evening
event
events
eventually
everybody
evidence
evil
ex
exactly
example
excellent
exception
exciting
excuse
executed
exist
existence
expect
expectations
expected
expecting
experience
explain
explained
explanation
exploitation
extra
extras
extreme
extremely
eye
eyes
face
faces
fact
factor
facts
fail
failed
fails
failure
fair
fairly
faith
fake
fall
falling
falls
fame
familiar
families
family
famous
fan
fans
fantastic
fantasy
far
fascinating
fashion
fast
fat
fate
father
fathers
fault
favor
favorite
favourite
fear
feature
features
featuring
feel
feeling
feelings
feels
feet
fell
fellow
felt
female
festival
fi
fiction
field
fight
fighting
fights
figure
filled
film
filmed
filming
filmmaker
filmmakers
films
final
finale
finally
finding
finds
fine
finest
finish
finished
fit
flashbacks
flat
flaws
flesh
flick
flicks
floor
fly
flying
focus
folks
follow
followed
following
follows
food
footage
football
force
forced
forces
ford
foreign
forever
forget
forgotten
form
formula
forward
fox
frame
france
frank
frankly
fred
free
freedom
french
fresh
friend
friends
friendship
fu
fully
fun
funniest
funny
future
gags
game
games
gang
gangster
garbage
gary
gave
gay
gem
gene
general
generally
generation
genius
genre
genuine
genuinely
george
german
gets
getting
ghost
giant
girl
girlfriend
girls
given
gives
giving
glad
god
goes
going
gold
golden
gone
gonna
good
gore
gorgeous
gory
got
gotten
government
grace
grade
grand
graphic
great
greatest
green
grew
ground
group
grow
growing
grown
guess
gun
guns
guy
guys
hadnt
hair
half
hall
halloween
hand
hands
handsome
happen
happened
happening
happens
happy
hard
hardly
harry
hate
hated
havent
having
head
heads
hear
heard
heart
heaven
heavy
heck
held
hell
help
helped
helps
henry
heres
hero
heroes
heroine
hes
hey
hidden
high
higher
highly
hilarious
historical
history
hit
hitchcock
hits
hold
holds
holes
hollywood
home
honest
honestly
hope
hopefully
hopes
hoping
horrible
horribly
horror
horse
hospital
hot
hotel
hour
hours
house
howard
huge
human
humanity
humans
humor
humorous
humour
hunter
hurt
husband
ice
id
idea
ideas
identity
ii
ill
im
image
images
imagination
imagine
imdb
immediately
impact
important
impossible
impressed
impression
impressive
include
included
includes
including
incredible
incredibly
independent
indian
individual
industry
information
innocent
insane
inside
inspired
instance
instead
intelligence
intelligent
intended
intense
interested
interesting
international
intriguing
introduced
involved
involves
involving
irritating
island
isnt
issue
issues
italian
ive
jack
jackson
james
jane
japan
japanese
jason
jean
jeff
jennifer
jerry
jesus
jim
jimmy
joan
job
joe
john
johnny
joke
jokes
jones
journey
joy
jr
judge
julie
jump
just
justice
keeping
keeps
kelly
kept
kevin
key
kick
kid
kids
kill
killed
killer
killers
killing
kills
kind
kinda
king
knew
know
knowing
knowledge
known
knows
kong
la
lack
lacking
lacks
ladies
lady
lame
land
language
large
late
later
laugh
laughable
laughed
laughing
laughs
laughter
law
lead
leader
leading
leads
learn
learned
leave
leaves
leaving
led
lee
left
legend
length
lesson
let
lets
level
levels
lewis
lies
life
light
lighting
likable
like
liked
likely
likes
limited
line
lines
list
listen
literally
little
live
lived
lives
living
local
location
locations
logic
london
long
longer
look
looked
looking
looks
loose
lord
lose
loses
loss
lost
lot
lots
loud
louis
lousy
love
loved
lovely
lover
lovers
loves
loving
low
luck
lucky
machine
mad
magic
magnificent
main
mainly
major
majority
make
makers
makes
making
male
man
manage
managed
manages
manner
mans
mark
marriage
married
martial
martin
mary
master
masterpiece
match
material
matt
matter
matters
max
maybe
mean
meaning
means
meant
media
mediocre
meet
meeting
meets
member
members
memorable
memories
memory
men
mental
mention
mentioned
merely
mess
message
met
michael
mid
middle
mike
miles
military
million
mind
mini
minor
minute
minutes
miss
missed
missing
mission
mistake
mix
mixed
model
modern
mom
moment
moments
money
monster
monsters
months
mood
moon
moore
moral
morning
mother
motion
mouth
moved
moves
movie
movies
moving
mr
mrs
ms
murder
murdered
murders
music
musical
mysterious
mystery
naked
named
names
narrative
nasty
national
native
natural
naturally
nature
near
nearly
necessary
need
needed
needs
negative
network
new
news
nice
nicely
nick
night
nightmare
noir
nominated
non
nonsense
normal
normally
north
note
notice
noticed
novel
nudity
number
numbers
numerous
obvious
obviously
occasionally
odd
offer
offers
office
officer
oh
ok
okay
old
older
ones
open
opening
opens
opera
opinion
opportunity
opposite
order
ordinary
original
originally
oscar
outside
outstanding
overall
overly
owner
pace
paced
pacing
page
paid
pain
painful
pair
paper
par
parents
paris
park
parody
particular
particularly
partner
parts
party
pass
passion
past
pathetic
paul
pay
people
peoples
perfect
perfectly
performance
performances
period
person
personal
personality
personally
perspective
peter
phone
photography
physical
pick
picked
picture
pictures
piece
pieces
pilot
pity
place
places
plain
plan
plane
planet
play
played
player
players
playing
plays
pleasure
plenty
plot
plots
plus
point
pointless
points
police
political
poor
poorly
pop
popular
porn
portray
portrayal
portrayed
portrays
positive
possible
possibly
post
potential
power
powerful
powers
pre
predictable
premise
presence
present
presented
president
pretentious
pretty
previous
price
priest
prison
private
probably
problem
problems
process
produced
producer
producers
product
production
professional
program
project
promise
proper
protagonist
prove
proved
proves
provide
provided
provides
psycho
psychological
public
pull
pulled
pure
purpose
puts
putting
quality
queen
question
questions
quick
quickly
quiet
quite
race
radio
ran
random
range
rape
rare
rarely
rate
rated
rating
ray
reach
reaction
read
reading
ready
real
realism
realistic
reality
realize
realized
really
reason
reasons
recall
received
recent
recently
recommend
recommended
record
red
redeeming
references
regular
relate
relationship
relationships
release
released
relief
religion
religious
remain
remains
remake
remarkable
remember
remembered
reminded
reminds
rent
rental
rented
rescue
respect
responsible
rest
result
results
return
returns
revealed
revenge
review
reviewer
reviewers
reviews
rich
richard
ride
ridiculous
right
ring
rip
rise
river
road
rob
robert
robin
rock
role
roles
roll
romance
romantic
room
round
rubbish
rules
run
running
runs
russian
ryan
sad
sadly
said
sake
sam
sat
satire
save
saved
saving
saw
say
saying
says
scared
scary
scene
scenery
scenes
school
sci
science
scientist
score
scott
scream
screaming
screen
screenplay
script
sea
sean
search
season
seat
second
seconds
secret
seeing
seemingly
seen
sees
self
sell
send
sense
sent
sequel
sequels
sequence
sequences
serial
series
seriously
set
sets
setting
seven
sex
sexual
sexy
shakespeare
shallow
shame
share
sharp
sheer
sheriff
shes
ship
shock
shocked
shocking
shoot
shooting
shop
short
shot
shots
shouldnt
showed
showing
shown
shows
sick
sight
sign
silent
silly
similar
simple
simply
sing
singer
singing
single
sister
sisters
sit
site
sitting
situation
situations
skills
skip
sky
slasher
sleep
slightly
slow
slowly
small
smart
smile
smith
soap
social
society
soft
soldier
soldiers
solid
somebody
somewhat
son
song
songs
soon
sorry
sort
soul
sound
sounds
soundtrack
south
space
spanish
speak
speaking
special
spectacular
speech
speed
spend
spent
spirit
spoiler
spoilers
spot
stage
stand
standard
standards
standing
stands
star
starring
stars
start
started
starting
starts
state
states
station
stay
steal
steals
step
stephen
stereotypes
steve
steven
stewart
stick
stock
stone
stop
store
stories
story
storyline
straight
strange
street
streets
strength
strong
strongly
struggle
stuck
student
students
studio
studios
study
stuff
stunning
stupid
style
sub
subject
subtle
success
successful
sucked
sucks
sudden
suddenly
suffering
suggest
suicide
suit
summer
super
superb
superior
support
supporting
suppose
supposed
supposedly
sure
surely
surprise
surprised
surprising
surprisingly
surreal
survive
suspect
suspense
sweet
sympathetic
taken
takes
taking
tale
talent
talented
talents
talk
talking
talks
tape
taste
taylor
teacher
team
tears
technical
tedious
teen
teenage
teenager
teenagers
teens
television
tell
telling
tells
tension
terms
terrible
terribly
terrific
terror
test
texas
thank
thanks
thats
theater
theaters
theatre
theme
themes
theres
theyre
theyve
thing
things
think
thinking
thinks
thomas
thoroughly
thought
thoughts
thriller
throw
thrown
tim
time
times
tiny
tired
title
today
todays
told
tom
tone
tony
took
torture
total
totally
touch
touching
tough
town
track
traditional
tragedy
tragic
trailer
train
trash
travel
treat
treated
treatment
trek
tried
tries
trip
trouble
true
truly
trust
truth
try
trying
turn
turned
turning
turns
tv
twice
twist
twists
type
types
typical
ugly
ultimate
ultimately
unable
unbelievable
uncle
underrated
understand
understanding
unexpected
unfortunately
unfunny
unique
united
unknown
unless
unlike
unnecessary
unrealistic
unusual
ups
use
used
uses
using
usual
usually
utter
utterly
value
values
vampire
vampires
van
various
version
vhs
victim
victims
video
view
viewed
viewer
viewers
viewing
village
villain
villains
violence
violent
vision
visit
visual
visually
visuals
voice
voices
vote
vs
wait
waiting
walk
walking
wall
want
wanted
wanting
wants
war
warning
wars
wasnt
waste
wasted
watch
watchable
watched
watching
water
way
ways
weak
wearing
wedding
week
weeks
weird
went
werent
west
western
weve
whats
whatsoever
whilst
white
whos
wide
wife
wild
william
williams
willing
win
wind
window
winning
wise
wish
wit
witch
witty
woman
women
won
wonder
wonderful
wonderfully
wondering
wont
wood
wooden
woods
word
words
work
worked
working
works
world
worlds
worse
worst
worth
worthy
wouldnt
wow
write
writer
writers
writing
written
wrong
wrote
yeah
year
years
yes
york
youd
youll
young
younger
youre
youth
youve
zero
zombie
zombies
